import java.util.Scanner;

public class firstMain {
    public static void main(String[] args) {
        // Напишите метод, вычисляющий выражение a * (b + (c / d))
        // и возвращающий результат,
        // где a, b, c, d — целочисленные входные параметры этого метода.
        Scanner scanner = new Scanner(System.in);
        int a, b, c, d;
        System.out.println("Input a");
        System.out.println("Input b");
        System.out.println("Input c");
        System.out.println("Input d");

    }
}
